Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: སེམས་ཅན་དགེ་བ་ཤིན་ཏུ་ཉུང་བ་དང་། དེའི་རྒྱུ་དང་། ཕྱོགས་བཅུ་དག་ན་ཡང་ཐེག་པ་དམན་པའི་སེམས་ཅན་མང་བ་དང་དེའི་རྒྱུ་དང་། བཤད་པ་འདི་རྒྱུན་མི་འཆད་པར་མཉན་པ་ལ་སོགས་པ་ལ་འཇུག་པར་བྱ་བ་དང་། རིན་པོ་ཆེ་སྣ་བདུན་གྱི་མཆོད་རྟེན་ལ་མཆོད་པ་བས་ཀྱང་ལྷག་པ་དང་།
en: It teaches that places come to serve as caityas because of the perfection of wisdom, and it teaches that the worship there of the perfection of wisdom is superior to worship of a caitya filled with the physical remains of a tathāgata and the reasons for that; that there are more beings who are lacking and many fewer who are good and the reasons for that; that in the ten directions there are more beings in the deficient vehicle and the reasons for that; that it is necessary to engage constantly in listening to this explanation and so on; that worshiping it is superior to worshiping “a stūpa be made of the seven precious things”; that there is more merit from that than from worshiping just a “Jambudvīpa,” just a “millionfold world system,” or just a “billionfold world system” full of stūpas; and that there is more merit from worshiping the perfection of wisdom than all beings in all world systems worshiping that many stūpas.

source: འཛམ་བུའི་གླིང་ཙམ་དང་། སྟོང་གཉིས་ཙམ་དང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོ་ཙམ་དང་། སེམས་ཅན་ཐམས་ཅད་དེ་སྙེད་ཀྱི་མཆོད་རྟེན་ལ་མཆོད་པ་བྱས་པ་བས་བསོད་ནམས་ཆེ་བ་བསྟན་པ་དང་། དེ་བཞིན་དུ་ཕྱོགས་བཅུ་སོ་སོར་ཡང་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་གཏོགས་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་རེ་རེས་ཀྱང་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་མཆོད་རྟེན་བྱས་ཏེ། དེ་ལ་མཆོད་པ་བྱས་པ་བས་ཀྱང་བསོད་ནམས་ཆེ་བ་དང་དེའི་རྒྱུ་དང་།
en: Similarly, it teaches there is more merit from worshiping it than if “each single being of the beings in as many world systems as there are sand particles in the Gaṅgā River in each of the ten directions” were to have made a stūpa of the seven precious things and worshiped it, and the reasons for that.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འཇིག་རྟེན་ན་གནས་ན་འཇིག་རྟེན་དང་། འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་ཁྱད་པར་ཅན་རྣམས་ཀྱི་རྒྱུར་འགྱུར་བ་དང་། བརྒྱ་བྱིན་ལ་གཏད་པ་དང་། ལྷ་དང་ལྷ་མ་ཡིན་གཡུལ་སྤྲོད་པའི་དཔེ་བརྗོད་པ་ལ་སོགས་པའི་ཡོན་ཏན་གྱི་ཕན་ཡོན་བསྟན་པ་དང་།
en: It teaches that when the perfection of wisdom is present in the world the cause of the special ordinary and extraordinary good qualities comes about; the entrusting to Śatakratu; and the benefits conveyed using the analogy of the gods and asuras when they “engage… in battle” and so on.

source: རིག་སྔགས་ཆེན་མོ་དང་། རིག་སྔགས་བླ་ན་མེད་པ་དང་། རིག་སྔགས་མི་མཉམ་པ་དང་མཉམ་པའི་མིང་སྨོས་པ་དང་། དེ་དག་གི་རྒྱུ་སྟོན་ཏེ།
en: It gives it the names “a great knowledge-mantra… an unsurpassable knowledge-mantra… a knowledge-mantra equal to the unequaled,” and teaches the reasons for those.

source: དེ་ལ་འཇིག་རྟེན་དང་། འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་ཐམས་ཅད་པས་ལྷག་པར་ཆེ་བའི་ཕྱིར་རིག་སྔགས་ཆེན་མོའོ། །བདག་གི་གོང་ན་གཞན་མེད་པའི་ཕྱིར་རིག་སྔགས་བླ་ན་མེད་པའོ། །བདག་དང་མཉམ་པ་མེད་པའི་ཕྱིར་རིག་སྔགས་མི་མཉམ་པ་དང་མཉམ་པའོ།
en: It is “a great knowledge-mantra” because it has all ordinary and extraordinary attributes and hence is exceedingly great; it is “an unsurpassable knowledge-mantra” because there is no other above it; and it is “a knowledge-mantra equal to the unequaled” because there is none equal to it.

source: །ཟླ་བའི་དཀྱིལ་འཁོར་གྱི་དཔེ་བརྗོད་པས་དཀར་པོའི་ཆོས་ཐམས་ཅད་རབ་ཏུ་འབྱུང་བའི་རྒྱུར་གྱུར་པ་དང་། ཐབས་མཁས་པའི་རྒྱུར་གྱུར་པ་དང་། ཡང་ཚེ་འདིའི་ཡོན་ཏན་རྣམས་དང་། དུག་དང་། མེ་དང་།
en: By giving the illustration of “the disk of the moon” it teaches that it serves as the cause of all bright dharmas issuing forth, and it serves as the cause of skillful means.

source: མཚོན་དང་། ཆུ་དང་ནད་ཀྱི་དབང་གིས་འཆི་བའི་དུས་མི་བྱེད་པ་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་གྱི་འཚེ་བ་མེད་པ་དང་། དཀར་པོའི་ཆོས་ཐམས་ཅད་དང་མི་འབྲལ་བ་དང་། སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། {
en: It also teaches “these good qualities in this very life… poisoning will not cause the time of their death… or fire, weapons, or water… up to sickness”; and they are not persecuted by retainers of “a royal family.”

source: ཡི་དགས་,ཡི་དྭགས་}སུ་སྐྱེ་བ་དང་། དབང་པོ་མ་ཚང་བ་དང་། ཡན་ལག་མ་ཚང་བ་དང་། རིགས་དམའ་བར་སྐྱེ་བ་མེད་པ་དང་། མཚན་དང་དཔེ་བྱད་ཀྱིས་བརྒྱན་པའི་ལུས་སུ་འགྱུར་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་
en: It teaches the benefits of these good qualities: they will not be separated from all the bright dharmas; they will not be “born in the hells, the animal world,” or as ghosts; they will not “have incomplete faculties… missing limbs… [or] be born in” a low caste; they will have “a body adorned with the marks” and signs; and they will take birth in a buddhafield, “pass on… to buddhafields… [and] bring beings to maturity and purify a buddhafield,” and so on.

source: དུ་སྐྱེ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་དུ་འགྲོ་བ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱེད་པ་ལ་སོགས་པའི་ཡོན་ཏན་གྱི་ཕན་ཡོན་དེ་དག་བསྟན་ཏོ། །དེ་ནས་ཡང་ཀུན་ཏུ་རྒྱུ་བ་བརྒྱ་ཕྱིར་དོང་བ་དང་། དེའི་རྒྱུ་དང་། བདུད་ཕྱིར་ལོག་པ་དང་། དེ་ནས་ཡང་ལྷ་ཐམས་ཅད་ཀྱིས་མཆོད་ཅིང་བསྔགས་པ་དང་། བསྲུང་ཞིང་བསྐྱབ་པར་དམ་བཅས་པ་དང་། འཛིན་པ་རྣམས་དགེ་བའི་རྩ་བ་མཆོག་དང་ལྡན་པར་འགྱུར་བ་རྣམས་བསྟན་ཏོ།
en: Then it teaches “religious mendicants… a hundred of them… went back,” and the reasons for that, and that “Māra… turned back”; that all the gods offer worship and praise, and make the commitment to “guard and protect”; and that those who take it up will become endowed with the finest wholesome roots.

source: །སྐབས་འདིར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་ངེས་པར་འབྱུང་བ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དོ།
en: In this context, what emerges from the perfection of wisdom is the knowledge of all aspects. “

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ལས་ངེས་པར་བྱུང་བ་ཞེས་བྱ་བ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ་ཞེས་བྱ་བ་ནི་ཀུན་རྫོབ་ཏུ་ཐ་དད་པར་བསྟན་པའོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་གཞན་མ་ཡིན། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་གཞན་མ་ཡིན་ཞེས་བྱ་བ་ནི་དོན་དམ་པར་ཐ་དད་པ་མེད་པར་བསྟན་པའོ།
en: Issues forth from… the knowledge of all aspects” and “the perfection of wisdom” teaches that they are different conventionally, and “the knowledge of all aspects is not one thing and the perfection of wisdom another” teaches that they are not different ultimately. “

source: །དེ་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་ངེས་པར་བྱུང་བ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དོ་ཞེས་བྱ་བ་ནི་སྒྲུབ་པའི་ས་ལའོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལས་ངེས་པར་བྱུང་བ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ་ཞེས་བྱ་བ་ནི་འབྲས་བུའི་ས་ལའོ།
en: The knowledge of all aspects issues forth from the perfection of wisdom” is the practice level; “the perfection of wisdom issues forth from the knowledge of all aspects” is the result level. “

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་གཞན་མ་ཡིན། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་གཞན་མ་ཡིན་ཞེས་བྱ་བ་ནི་གཉི་གར་ཡང་ཆོས་ཀྱི་སྐུའི་བདག་ཉིད་ཡིན་པའི་ཕྱིར་རོ། །དེའི་འོག་ཏུ་ཀུན་དགའ་བོས་ཞུས་པ་དང་།
en: The knowledge of all aspects is not one thing and the perfection of wisdom another” because both constitute the dharma body.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱི་ཐོག་མར་འགྲོ་བ་ཞེས་བྱ་བ་ནས། ཀུན་དགའ་བོ་གཉིས་སུ་མེད་པའི་ཚུལ་གྱིས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་བསྔོས་པ་ཞེས་བྱ་བ་ནི་གང་གི་ཚེ་སྦྱིན་པ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོ་བ་དེའི་ཚེ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་འབྲས་བུའི་ས་ལ་ཐ་དད་པ་མེད་ཅིང་། གཉིས་སུ་མེད་པར་སོ་སོར་བརྟགས་ཏེ། སྦྱིན་པ་བྱེད་པ་དེའི་ཚེ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བའི་མིང་འཐོབ་པོ།
en: After that Ānanda speaks, and then, from “all the buddhadharmas are preceded by the perfection of wisdom,” up to “Ānanda, … have been dedicated to the knowledge of all aspects in a nondual way,” it says that when giving has been dedicated to the knowledge of all aspects, at that time, having understood analytically that the perfection of giving and the knowledge of all aspects are not different and not two at the result level, when engaging in giving it “gets the name ‘perfection of giving.’ ” “

source: །ཀུན་དགའ་བོ་གཟུགས་གཉིས་སུ་མེད་པའི་ཚུལ་དང་དམིགས་སུ་མེད་པའི་ཚུལ་དང་། ལེན་པ་མེད་པའི་ཚུལ་གྱིས་ཞེས་བྱ་བ་དང་ཆོས་ཉིད་ཀྱི་གཟུགས་ནི་གཉིས་སུ་མེད་པའི་ཚུལ་གྱིས་སོ། །ཀུན་བརྟགས་པའི་གཟུགས་ནི་དམིགས་སུ་མེད་པའི་ཚུལ་གྱིས་སོ། །རྣམ་པར་བརྟགས་པའི་གཟུགས་ནི་ལེན་པའི་ཚུལ་གྱིས་སོ།
en: Ānanda, by way of the nonduality of form, in a nonappropriating way, in a nonapprehending way”— the true dharmic nature of form is “by way of the nonduality of form”; falsely imagined form is “by way of nonapprehending”; and conceptualized form is “by way of nonappropriating.”

source: །གཉིས་སུ་མེད་པ་གང་ཡིན་པ་དེ་དམིགས་སུ་མེད་པའོ་ཞེས་བྱ་བ་ལ་གཉིས་སུ་མེད་པ་ནི་ཡོངས་སུ་གྲུབ་པ་སྟེ།
en: In “that which is nondual cannot be apprehended,” the nondual is the thoroughly established phenomenon.

source: དམིགས་ཤིང་ཀུན་བརྟགས་པས་མངོན་པར་ཞེན་པར་མི་འགྱུར་རོ།
en: It is not settled down on as something apprehended and falsely imagined. “

source: །གང་དམིགས་སུ་མེད་པ་དེ་ལེན་པ་མེད་པའོ་ཞེས་བྱ་བ་ནི། གང་དམིགས་པའི་ཚུལ་གྱིས་མངོན་པར་ཞེན་པར་མི་འགྱུར་བ་དེ་རྣམ་པར་རྟོག་པའི་ཡིད་ལ་བྱེད་པས་ཉེ་བར་ལེན་པར་མི་འགྱུར་རོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: That which cannot be apprehended is not appropriated” means that the absence of settling down by way of apprehending is not appropriated by the conceptualization that pays attention to it.

source: །དེ་ནས་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཡོན་ཏན་དཔག་ཏུ་མེད་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ལ་སོགས་པ་ཚད་མེད་པའི་རྒྱུར་གྱུར་པ་དང་། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ལ་སོགས་པ་ཟིལ་གྱིས་གནོན་པ་དང་། བརྒྱ་བྱིན་གྱིས་བསྲུང་ཞིང་བསྐྱབ་པ་དང་སྦ་བར་དམ་བཅས་པ་དང་། ལྷ་རྣམས་སྤོབས་པ་བསྒྲུབ་པ་དང་། འཁོར་གྱི་ནང་དུ་སེམས་ཞུམ་པ་མེད་པ་དང་། ཀླན་ཀ་ཚོལ་བ་མེད་པ་དང་། སེམས་ཞུམ་པ་ལ་སོགས་པ་མེད་པ་དང་། འཇིག་རྟེན་ཐམས་ཅད་དགའ་བ་དང་། ཆོས་ཉིད་རྒྱུན་མི་འཆད་པ་དང་། ལྷ་ཐམས་ཅད་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འཛིན་པ་དང་། དེ་དག་ལ་ཆོས་སྦྱིན་པ་དང་། ལྷ་དེ་དག་རྣམས་ཀྱིས་བསྲུང་བ་དང་། ལྷ་རྣམས་འོང་བའི་རྟགས་དང་། ལྷ་ངན་པ་རྣམས་འདོང་བ་དང་། རྒྱ་ཆེན་པོ་ལ་མོས་པ་དང་། ས་ཕྱོགས་མཆོད་པར་འགྱུར་བ་དང་། ལུས་བདེ་བ་ལ་སོགས་པ་འབྱུང་བ་དང་། སྙོམ་པ་ལ་སོགས་པ་མེད་པ་དང་། རྨི་ལམ་བཟང་པོ་རྨི་བ་དང་།
en: Then again it teaches infinite good qualities of the perfection of wisdom: that it serves as the cause of “an immeasurable… morality” and so on, and surpasses the “morality… of śrāvakas and pratyekabuddhas” and so on.

source: ལུས་ལ་གཟི་མདངས་འཇུག་པ་དང་། རྐྱེན་རྣམས་པ་བཞི་ལ་མ་ཆགས་པ་དང་། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་རྣམས་སུ་སངས་རྒྱས་ཐམས་ཅད་ལ་རྐྱེན་རྣམ་པ་བཞིས་མཆོད་པ་དང་། རིན་པོ་ཆེ་སྣ་བདུན་གྱི་མཆོད་རྟེན་བྱས་ཏེ་མཆོད་པ་བས་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་བཟུང་བ་ལ་སོགས་པ་མ་བྱས་པར་རིམ་གྲོ་ཙམ་འགའ་ཞིག་བྱས་པའི་བསོད་ནམས་ཆེ་བ་དང་། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་འཛམ་བུའི་གླིང་དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་གིས་ཡོངས་སུ་བཀང་བ་བས་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འཛིན་པ་བསོད་ནམས་ཆེ་བ་དང་།
en: It teaches Śatakratu’s commitment to “guard, protect, and keep safe”; the gods connecting with confidence giving a readiness to speak; not being cowed in front of retinues; not fault-finding; not feeling cowed and so on; being liked by the whole world; the seamless true nature of dharmas; all the gods taking up the perfection of wisdom; the offering of a gift of Dharma to them; the gods guarding; the sign “the gods have come”; the inferior gods withdrawing; belief in the vast; worship of the place; feeling a sense of physical pleasure and so on; having no weariness and so on; having good dreams; bodies being infused with energy; not being greedy for the four requirements; worshiping all the buddhas in world systems all around in the ten directions with the four requirements; there being more merit merely from having respected this perfection of wisdom, even if it has not been taken up and so on, than from having stūpas made of the seven various precious stones and worshiping them; and there being more merit from taking up the perfection of wisdom than were “Śatakratu, head of the gods” to have “filled this Jambudvīpa right to the top with the physical remains of the tathāgatas,” and the reasons for that.

source: དེའི་རྒྱུ་བསྟན་ཏོ། །སྐབས་འདིར། ཀཽ་ཤི་ཀ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ནི་གཟུང་དུ་མེད་པ་ཞེས་བྱ་བ་ནི་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པས་གཟུང་དུ་མེད་པའི་ཕྱིར་རོ།
en: In this context, “Kauśika, the perfection of wisdom cannot be apprehended” because it “cannot be apprehended” with thinking-mind consciousness.

source: །བསྟན་དུ་མེད་པ་ཞེས་བྱ་བ་ནི་ཚིག་གིས་བསྟན་མི་ནུས་པའི་ཕྱིར་རོ།
en: It “cannot be pointed out” because it “cannot be pointed out” with words.

source: །ཐོགས་པ་མེད་པ་ཞེས་བྱ་བ་ནི་དབང་པོའི་རྣམ་པར་ཤེས་པའི་ཡུལ་མ་ཡིན་པས་ཡུལ་གྱི་ཐོགས་པ་མེད་པའི་ཕྱིར་རོ།
en: It “does not obstruct” because, since it is not an object of sense consciousness, it “does not obstruct” as an object does.

source: །འདི་ལྟར་མཚན་ཉིད་མེད་པར་མཚན་ཉིད་གཅིག་པ་ཞེས་བྱ་བ་ནི་ཀུན་བརྟགས་པའི་མཚན་ཉིད་ཐམས་ཅད་ཀྱི་མཚན་མ་དང་བྲལ་བའི་ཕྱིར་རོ། །འཛིན་པའི་ཕྱིར་རམ་མི་འཛིན་པའི་ཕྱིར་ཡང་གནས་པ་མ་ཡིན་ཞེས་བྱ་བ་ནི་གཟུང་བར་བྱ་བ་དང་།
en: It “has only one mark—that is, no mark” because it is separated from all imaginary marks. “

source: གཟུང་བར་མི་བྱ་བར་རྣམ་པར་བརྟགས་པའི་འོས་མ་ཡིན་པའི་ཕྱིར་རོ། །འགྲིབ་པའི་ཕྱིར་མ་ཡིན་འཕེལ་བའི་ཕྱིར་མ་ཡིན་ཞེས་བྱ་བ་ནི་ནག་པོའི་ཕྱོགས་ཀྱི་ཆོས་སྤང་བའམ། དཀར་པོའི་ཕྱོགས་ཀྱི་ཆོས་སྤེལ་བའི་ཕྱིར་གནས་པ་མ་ཡིན་པའོ། །དབྲི་བའི་ཕྱིར་མ་ཡིན། བསྣན་པའི་ཕྱིར་མ་ཡིན་ཞེས་བྱ་བ་ནི་འཁོར་བའི་ཆོས་བསལ་བའམ་མྱ་ངན་ལས་འདས་པའི་ཆོས་བསྒྲུབ་པའི་ཕྱིར་གནས་པ་མ་ཡིན་པ་སྟེ།
en: It is not a place to be seized or not seized” because it is not suitable to be conceptualized as something that can be seized or something that cannot be seized; “to be increased or reduced” because it is not a place for the elimination of things on the dark side or the increase of things on the bright side; or “to be taken away from or added to” because it is not a place for the removal of saṃsāric dharmas or the accomplishment of nirvāṇic dharmas.

source: དེ་ན་དེ་ལྟ་བུའི་རྣམ་པར་རྟོག་པ་ལ་མངོན་པར་ཞེན་པ་ཐམས་ཅད་མེད་པའི་ཕྱིར་སྟེ།
en: Because it is without all attachments to such conceptualizations.

source: དེ་བཞིན་དུ་ཐམས་ཅད་ལ་སྦྱར་བར་བྱའོ།
en: You should connect it in the same way with them all. “

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་གཉིས་སུ་ཉེ་བར་གནས་པ་མ་ཡིན་ཞེས་བྱ་བ་ནི་གལ་ཏེ་འཛིན་པ་དང་མི་འཛིན་པ་ལ་སོགས་པའི་ཚུལ་དུ་གནས་པར་གྱུར་ན། དེ་ལྟ་ན་ནི་གཉིས་ཀྱི་བདག་ཉིད་དང་། ཐ་དད་པའི་བདག་ཉིད་དུ་གནས་པར་འགྱུར་ན། འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དེ་དོན་དམ་པར་གཅིག་ཅིང་ཐ་དད་པ་མེད་པའོ། །དེ་བས་ན་དེ་ལ་འདི་ལྟ་བུར་སྤྱོད་པའི་སྤྲོས་པ་མེད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: A dual perfection of wisdom is not available” means were the perfection of wisdom to be a mode of seizing and not seizing and so on, it would be in a dual state and would be available with a diverse nature, but it is ultimately one, not broken apart, so ultimately such a proliferation of activity is absent from it. “

source: །དེ་བཞིན་དུ་སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་ལ་སོགས་པ་ཡང་དོན་དམ་པའི་གནས་སྐབས་སུ་གཅིག་པའི་ངོ་བོ་ཉིད་དེ་ཐ་དད་པ་མེད་པས་གཉིས་སུ་མེད་དོ།
en: Similarly, a perfection of giving, a perfection of morality,” and so on, in the ultimate state are essentially one, and hence “are not two,” because they are not broken apart.

source: །དེ་བས་ན། ཀཽ་ཤི་ཀ་དེ་བཞིན་ཉིད་ལ་གཉིས་སུ་འདོད་དུ་ཟད་དོ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་ཏེ།
en: Therefore, it says, “Kauśika… is simply to accept suchness as two,” and so on.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སོགས་པ་དེ་དག་ཐམས་ཅད་ནི་དེ་བཞིན་ཉིད་ཀྱི་བདག་ཉིད་དུ་གཅིག་སྟེ་གཉིས་སུ་མེད་པར་གནས་པའོ།
en: All those perfections of wisdom and so on are one in the form of suchness; they are not there as a duality.

source: །ཆོས་བཟང་ལྷའི་འདུན་སའི་དཔེ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་བྱུང་བ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྐུ་གདུང་བསྟན་ཏོ།
en: It gives the illustration of [the throne] “in the Sudharmā assembly of gods” and teaches that the physical remains of all the tathāgatas have come about from this perfection of wisdom. “

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་རྟགས་མེད་པ་དང་། བརྗོད་དུ་མེད་པ་ལ་སོགས་པས་སྤྲོས་པ་ཐམས་ཅད་དང་བྲལ་བའི་ཕྱིར།
en: The perfection of wisdom has no causal sign” because it “has no token, is inexpressible,” and so on, and is therefore separated from all thought constructions.

source: མཚན་མ་མེད་པའོ། །རང་གི་མཚན་ཉིད་དང་བྲལ་བའི་ཕྱིར་རྟགས་མེད་པའོ།
en: It “has no token” because it is separated from its own defining mark.

source: །ཚིག་གི་སྤྱོད་ཡུལ་མ་ཡིན་པའི་ཕྱིར་བརྗོད་དུ་མེད་པའོ།
en: It “is inexpressible” because it is not within the range of words.

source: །སྒྲའི་བདག་ཉིད་མ་ཡིན་པའི་ཕྱིར་སྨོས་སུ་མེད་པར་རོ།
en: It “cannot be talked about” because it is not in the form of language.

source: །སོ་སོ་རང་གིས་རིག་པའི་ཕྱིར་བསམ་གྱིས་མི་ཁྱབ་པའོ།
en: It “is inconceivable” because it is self-reflexive analytic knowledge.

source: །དེའི་འོག་ཏུ་ངན་འགྲོ་ཐམས་ཅད་དང་ཐེག་པ་དམན་པའི་བསམ་པ་ལ་སོགས་པ་མེད་པ་དང་། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་གིས་ཡོངས་སུ་བཀང་བ་བས་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འཛིན་པ་བསོད་ནམས་ཆེ་བ་དང་། དེའི་རྒྱུ་དང་། དེ་བཞིན་གཤེགས་པ་དང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གཉིས་སུ་མེད་པ་དང་། ཕྱོགས་བཅུའི་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ཆོས་རྣམ་པ་བཅུ་གཉིས་བཤད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཀློག་པ་གཉིས་མཚུངས་པ་དང་། ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་མཆོད་པ་དང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་མཆོད་པ་མཚུངས་པ་དང་། ཕྱིར་མི་ལྡོག་པའི་ས་ལ་གནས་པ་དང་། སྐྱེས་བུ་ནོར་གྱི་བདག་པོ་བུ་ལོན་པའི་འཇིགས་སྐྲག་པའི་དཔེ་བརྗོད་པ་དང་།
en: After that it teaches that there will be none of the bad forms of life or lesser vehicle aspirations and so on; that there is more merit from taking up this perfection of wisdom than from “this billionfold world system filled right to the top with the physical remains of tathāgatas,” and the reasons for that; that “the tathāgata and the perfection of wisdom are not two”; that for all the buddhas in the ten directions to teach the twelvefold doctrine and to read the perfection of wisdom out loud “is equivalent”; and that worshiping all the tathāgatas of the ten directions and worshiping the perfection of wisdom “is equivalent.”

source: ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་ཆོས་ཉིད་འཐོབ་པ་དང་། ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོའི་དཔེ་བརྗོད་པ་དང་། ཡང་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་གིས་ཡོངས་སུ་བཀང་བ་བས་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འཛིན་པ་བསོད་ནམས་ཆེ་བ་དང་། དེའི་རྒྱུ་དང་། ཆོས་ཀྱི་སྐུ་དང་གཟུགས་ཀྱི་སྐུ་དང་ཡེ་ཤེས་ཀྱི་སྐུ་རྣམས་མཐོང་བ་སྟོན་ཏེ།
en: It teaches that those who have taken up the perfection of wisdom and so on stand on the irreversible level; the analogy of “a person fearful of rich creditors”; that they reach the true nature of dharmas— “complete nirvāṇa”; the analogy of “the large jewel”; again, that there is more merit from taking up this perfection of wisdom than from “as many… world systems as there are sand particles in the Gaṅgā River filled right to the top with the physical remains of tathāgatas,” and the reason for that; and seeing “the dharma body, the form body, and the knowledge body.”

source: ཡེ་ཤེས་ཀྱི་སྐུ་ནི་ཡེ་ཤེས་ཀྱི་ཚོགས་སོ།
en: The “knowledge body” is the knowledge accumulation. “

source: །འདུས་བྱས་ཀྱི་ཆོས་ཉིད་ཅེས་བྱ་བ་ནི་རྣམ་པར་རྟོག་པ་དང་བཅས་པའི་ཡེ་ཤེས་ཀྱི་ངོ་བོ་ཉིད་དོ།
en: What the dharmas actually are when compounded”— they have transcendental knowledge with conceptualization as their intrinsic nature. “

source: །འདུས་མ་བྱས་ཀྱི་ཆོས་ཉིད་ཅེས་བྱ་བ་ནི་བརྗོད་དུ་མེད་པ་དོན་དམ་པའི་ངོ་བོ་ཉིད་ནི་འདུས་མ་བྱས་ཀྱི་ཆོས་ཉིད་དོ།
en: What dharmas actually are when they are uncompounded”— the intrinsic nature that is the inexpressible, the ultimate is what dharmas actually are when they are uncompounded. “

source: །ཐེག་པ་གསུམ་རྒྱ་ཆེར་བསྟན་ཏེ་དེ་དག་མཚན་མ་མེད་པའི་ཚུལ་དང་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པའི་ཚུལ་དང་ཞེས་བྱ་བ་ལ་སོགས་པ་ལ་ཉན་ཐོས་རྣམས་ཀྱིས་འབྲས་བུའི་གནས་སྐབས་སུ་མྱ་ངན་ལས་འདས་པ་ལས་དགོངས་ཏེ་གསུངས་སོ།
en: Gives detailed instruction for the three vehicles, and instruction by way of no causal sign, by way of no production, by way of no stopping,” and so on—it says this intending the nirvāṇa of śrāvakas at the result stage.

source: །དོན་དམ་པར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཕ་རོལ་ལམ། ཚུ་རོལ་མ་ཡིན་ཐང་མ་ཡིན།
en: Ultimately, the perfection of wisdom “is not over there or over here, or has stayed up or sunk down,” and so on.

source: གཤོང་མ་ཡིན་ཞེས་བྱ་བ་ལ་སོགས་པ་དོན་དམ་པར་ཡང་ཡོངས་སུ་གྲུབ་པའི་གནས་སྐབས་ན་དེ་ལྟ་བུའི་རྣམ་པར་རྟོག་པ་དང་མཚན་མ་མེད་པའི་ཕྱིར་དེ་སྐད་བཤད་དོ།
en: It explains it like this because, again, at the thoroughly established stage such conceptualizations and causal signs do not exist. “

source: །བརྒྱ་བྱིན་གྱིས་གསོལ་པ་བཅོམ་ལྡན་འདས་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཆེན་མོ་སྟེ་ཞེས་བྱ་བ་ནི་ཤེས་རབ་ཀྱི་ངོ་བོ་ཉིད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསམས་ཏེ་སྨྲས་པའོ།
en: Replied Śatakratu, “This—that is, the perfection of wisdom—is a great perfection.” He says this having thought about the intrinsic nature of the wisdom that is perfect.

source: །དེ་ནི་ཆོས་ཐམས་ཅད་མི་དམིགས་པ་ཡིད་ལ་བྱེད་པས་མི་མཐོང་སྟེ་ཡུལ་ཆེ་བས་ནམ་མཁའ་དང་མཚུངས་སོ།
en: The attention that does not apprehend any dharma does not see it, so it is like space because it is a greater object.

source: །ཤིང་ལྗོན་པའི་དཔེ་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཤིང་ལྟ་བུའོ། །དེ་ལས་གཞན་པ་རྣམས་ནི་གྲིབ་མ་ལྟ་བུའོ།
en: As for the analogy of the trees, the perfection of wisdom is like the trees; those other than it are like the shadows.

source: །བདག་གིས་མཆོད་པ་བས་ཀྱང་གཞན་ལ་བྱིན་པ་འབྲས་བུ་ཆེ་བ་སྟོན་ཏོ།
en: It teaches that giving to others has a greater result than personal worship. “

source: །རྡོ་རྗེ་ལྟ་བུའི་སྐུ་བཤིག་སྟེ་དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་དུ་བྱིན་གྱིས་བརླབས་སོ་ཞེས་བྱ་བ་འདིས་ནི་བགོ་བཤའ་བྱས་པ་འབྲས་བུ་ཆེ་བ་བསྟན་ཏོ།
en: Shatters the vajra-like body and imbues the physical remains of the tathāgata with a special power”— this teaches that what has been shared has a greater result. “

source: །གཞན་དག་གི་དྲུང་དུ་སོང་སྟེ་བཤད་ཅེས་བྱ་བས་ནི་སྟོན་པའི་བྱེད་པ་བསྟན་ཏོ།
en: Who goes to others and explicates” is teaching the activity of teaching. “ ‘

source: །ཆོས་གང་ཞིག་ལ་བདག་གིས་རིམ་གྲོ་དང་བཀུར་སྟི་དང་བསྟི་སྟང་དང་མཆོད་པ་བྱས་ཏེ་བསྟེན་ཅིང་གནས་པར་བྱ་སྙམ་ན་ཞེས་བྱ་བ་ནི་དེ་བཞིན་གཤེགས་པ་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ལ་མཆོད་པ་མཛད་ན། དེ་ལས་གཞན་པ་ལྟ་ཅི་སྨོས་ཞེས་བྱ་བར་སྟོན་ཏོ།
en: What should I rely on and stay by, whom should I respect, revere, honor, and worship?’ ” is teaching that if even the Tathāgata worshiped this perfection of wisdom, it goes without saying those others than him should.

source: །ཀཽ་ཤི་ཀ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པས་ཞེས་བྱ་བའི་འགྲེས་འདིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཐམས་ཅད་ཀྱི་རྒྱུའི་གཙོ་བོ་ཡིན་ཏེ། དེ་བས་ན་མཆོད་པར་བྱའོ་ཞེས་བསྟན་པའོ།
en: The section of the passage that says, “Kauśika, those sons of a good family or daughters of a good family who have entered into the Śrāvaka Vehicle or who have entered into the Pratyekabuddha Vehicle,” is teaching that the perfection of wisdom is the principal cause and therefore should be worshiped.

source: །དེའི་འོག་ཏུ་འཛམ་བུའི་གླིང་གི་སེམས་ཅན་ཐམས་ཅད་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་བཀོད་པ་བས་སེམས་ཅན་གཅིག་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་གཞག་པ་བསོད་ནམས་ཀྱི་འབྲས་བུ་ཆེ་བར་བསྟན་པའི་འགྲེས་དང་།
en: Then there is a section teaching that the result of merit is greater “from establishing one being in the result of stream enterer, but not so much from establishing the beings in Jambudvīpa in the ten wholesome actions.”

source: དེས་ཡང་འཛམ་བུའི་གླིང་གི་སེམས་ཅན་ཐམས་ཅད་དགྲ་བཅོམ་པ་དང་རང་བྱང་ཆུབ་ཀྱི་བར་ལ་བཀོད་པ་བས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གླེགས་བམ་དུ་བྱས་ཏེ་བྱིན་པ་བསོད་ནམས་ཆེ་བའི་འགྲེས་ཀྱིས་བསོད་ནམས་མང་དུ་བསྟན་པ་འཕེལ་བ་བསྟན་ནས། དེའི་རྒྱུས་ཟག་པ་མེད་པའི་ཆོས་བསྟན་པ་དང་། འཇིག་རྟེན་པའི་གང་ཟག་ཁྱད་པར་དུ་འཕགས་པ་ཐམས་ཅད་མངོན་པའི་རྒྱུར་གྱུར་པ་དང་། འཕགས་པའི་གང་ཟག་མངོན་པའི་རྒྱུར་གྱུར་པ་དང་། དེ་ནས་ཡང་གླིང་བཞི་པ་དང་། སྟོང་གཅིག་དང་། སྟོང་གཉིས་དང་།
en: Then, having taught the increase in merit in a further section, teaching that there is more merit from having “written out this perfection of wisdom in book form and bestowed it” than from, up to “establishing all the beings in Jambudvīpa in the state of a worthy one and a pratyekabuddha’s awakening,” and taught that the reason for that is that “in this perfection of wisdom are taught the dharmas without outflows,” it teaches that it serves as the cause for the appearance of all ordinary special beings and serves as the cause for the appearance of noble beings.
